import 'dart:ui';

import 'package:flutter/cupertino.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

import '../../../features/presentation/screens/azkar/azkar_layout.dart';
import '../../../features/presentation/screens/qebla_compass/qeblah_compass_screen.dart';
import '../../../features/presentation/screens/quran/quran_screen.dart';
import '../../../features/presentation/screens/tasbeeh/tasbeeh_screen.dart';
import '../assets/assets.dart';

class AppConsts {
  AppConsts._();

  ///
  final isPortrait = Orientation.portrait;

  // ints
  static double font7size = 7.sp;
  static double font8size = 8.sp;
  static double font9size = 9.sp;
  static double font10size = 10.sp;
  static double font11size = 11.sp;
  static double font12size = 12.sp;
  static double font13size = 13.sp;
  static double font14size = 14.sp;
  static double font15size = 15.sp;
  static double font16size = 16.sp;
  static double font17size = 17.sp;
  static double font18size = 18.sp;
  static double font19size = 19.sp;
  static double font20size = 20.sp;
  static double font21size = 21.sp;
  static double font22size = 22.sp;
  static double font23size = 23.sp;
  static double font24size = 24.sp;
  static double font25size = 25.sp;
  static double font30size = 30.sp;
  static double font34size = 34.sp;
  static double font40size = 40.sp;
  static double font50size = 50.sp;

  // strings
  static const String bismillah = 'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ';
  static const String endSurah = 'صدق الله العظيم';

  // fonts
  static const String tajawal = 'Tajawal';
  static const String uthmanic = 'Uthmanic';
  static const String reemKufi = 'Reem_Kufi';

  // apis
  /// bodyURL (static): https://api.aladhan.com/v1/
  /// method: calendarByCity/{year}/{month}
  /// parameters: ?city=Alexandria&country=EG
  static const String azanBodyUrl = 'https://api.aladhan.com/v1';
  static const String todayAzanByAddress = '$azanBodyUrl/timings/';
  static const String fullAzanByAddress = '$azanBodyUrl/calendar/';

  // colors
  static const Color basicAppColor = Color(0xFF926AC6);
  static const Color basicDarkAppColor = Color(0xFF1A062E);
  static const Color secondaryAppColor = Color(0xFF9A71C2);
  static const Color secondaryDarkAppColor = Color(0xFF6314AD);
  static const Color blueDarkColor = Color(0xFF45C4B8);
  static const Color blueLightColor = Color(0xFF64F2DD);
  static const Color orangeDarkColor = Color(0xFFFE6A16);
  static const Color orangeLightColor = Color(0xFFFF9D00);
  static const Color brownDarkColor = Color(0xFFA65D4E);
  static const Color brownLightColor = Color(0xFFC38778);
  static const Color skyBlueDarkColor = Color(0xFF7D81E7);
  static const Color skyBlueLightColor = Color(0xFF8BB9FF);
  static const Color quranIndicatorColor = Color(0xFFA96F16);

  // lists
  static const List<String> redWords = [
    "ٱللَّهِ",
    "لِلَّهِ",
    "ٱللَّهُ",
    "ٱللَّهَ",
    "الٓمٓ",
    "الٓمٓصٓ",
    "الٓرۚ",
    "الٓمٓرۚ",
    "كٓهيعٓصٓ",
    "طه",
    "طسٓمٓ",
    "طسٓۚ",
    "يسٓ",
    "صٓۚ",
    "حمٓ",
    "حم",
    "عٓسٓقٓ",
    "قٓۚ",
    "نٓۚ",
    "۞ ",
    "ۖ ",
    "ۚ",
    "ۗ",
    "ۛ"
  ];
  static const List<String> shortSurah = [
    "سُورَةُ ٱلْفَاتِحَةِ",
    "سُورَةُ الانْفِطَارِ",
    "سُورَةُ الانْشِقَاقِ",
    "سُورَةُ الطَّارِقِ",
    "سُورَةُ الأَعۡلَىٰ",
    "سُورَةُ الفَجْرِ",
    "سُورَةُ البَلَدِ",
    "سُورَةُ الشَّمۡسِ",
    "سُورَةُ الضُّحَىٰ",
    "سُورَةُ الشَّرۡحِ",
    "سُورَةُ التِّينِ",
    "سُورَةُ العَلَقِ",
    "سُورَةُ القَدۡرِ",
    "سُورَةُ البَيِّنَةِ",
    "سُورَةُ الزَّلۡزَلَةِ",
    "سُورَةُ العَادِيَاتِ",
    "سُورَةُ القَارِعَةِ",
    "سُورَةُ التَّكَاثُرِ",
    "سُورَةُ العَصۡرِ",
    "سُورَةُ الهُمَزَةِ",
    "سُورَةُ الفِيلِ",
    "سُورَةُ قُرَيۡشٍ",
    "سُورَةُ المَاعُونِ",
    "سُورَةُ الكَوۡثَرِ",
    "سُورَةُ الكَافِرُونَ",
    "سُورَةُ النَّصۡرِ",
    "سُورَةُ المَسَدِ",
    "سُورَةُ الإِخۡلَاصِ",
    "سُورَةُ الفَلَقِ",
    "سُورَةُ النَّاسِ",
  ];
  static const List<String> listAzkars = [
    "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.",
    "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ.",
    "اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ.",
    "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا.",
    "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ.",
    "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ.",
    "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي.",
    "اللَّهُمَّ مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ.",
    "اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي.",
    "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.",
    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ.",
    "غُفْرَانَكَ.",
    "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا.",
    "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ.",
    "اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ مَاضٍ فِيَّ حُكْمُكَ عَدْلٌ فِيَّ قَضَاؤُكَ أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي وَنُورَ صَدْرِي وَجَلَاءَ حُزْنِي وَذَهَابَ هَمِّي.",
    "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ.",
    "اللَّهُمَّ صَيِّبًا نَافِعًا.",
    "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ.",
    "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَأَعُوذُ بِكَ مِنْ شَرِّهَا.",
    "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ.",
    "اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْيُمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ رَبِّي وَرَبُّكَ اللَّهُ.",
    "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ أَسْأَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ.",
    "الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ.",
    "إِنَّ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلُّ شَيْءٍ عِنْدَهُ بِأَجَلٍ مُسَمًّى فَلْتَصْبِرْ وَلْتَحْتَسِبْ.",
    "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا.",
    "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ.",
    "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ.",
    "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ.",
    "اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الْأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ.",
    "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلَاكَ بِهِ وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلًا.",
    "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ.",
    "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ.",
    "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ.",
    "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
    "اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ وَتَعْلَمُ وَلَا أَعْلَمُ وَأَنْتَ عَلَّامُ الْغُيُوبِ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي عَاجِلِهِ وَآجِلِهِ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي عَاجِلِهِ وَآجِلِهِ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ رَضِّنِي بِهِ.",
    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَمِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ.",
    "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
    "اللَّهُمَّ رَبَّ النَّاسِ أَذْهِبِ الْبَاسَ اشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا.",
    "اللَّهُمَّ يَا مُسَهِّلَ الشَّدِيدِ وَيَا مُلَيِّنَ الْحَدِيدِ وَيَا مُنْجِزَ الْوَعِيدِ وَيَا مَنْ هُوَ كُلَّ يَوْمٍ فِي أَمْرٍ جَدِيدٍ أَخْرِجْنِي مِنْ حَلْقِ الضِّيقِ إِلَى أَوْسَعِ الطَّرِيقِ بِكَ أَدْفَعُ مَا لَا أُطِيقُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ.",
    "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ.",
    "جَزَاكَ اللَّهُ خَيْرًا.",
    "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ.",
    "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ.",
    "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ.",
    "لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ.",
    "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي.",
    "بِسْمِ اللَّهِ.",
    "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ.",
    "بِسْمِ اللَّهِ وَلَجْنَا وَبِسْمِ اللَّهِ خَرَجْنَا وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا.",
    "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ.",
    "الْحَمْدُ لِلَّهِ.",
    "يَرْحَمُكَ اللَّهُ.",
    "يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ.",
    "يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ.",
    "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ يَا حَيُّ يَا قَيُّومُ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ.",
    "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ.",
    "أَسْتَغْفِرُ اللَّهَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ."
  ];
  static List<Map<String, dynamic>> get services => [
        {
          "title": "القرآن \nالكريم",
          "image": AppAssets.quranIcon,
          "screen": const QuranScreen(),
          "light_color": AppConsts.orangeLightColor,
          "dark_color": AppConsts.orangeDarkColor,
          "align": 1
        },
        {
          "title": "مجمع \nالأذكار",
          "image": AppAssets.sunnahIcon,
          "screen": const AzkarLayout(),
          "light_color": AppConsts.brownLightColor,
          "dark_color": AppConsts.brownDarkColor,
          "align": 2
        },
        {
          "title": "تحديد \nالقِبْلة",
          "image": AppAssets.kaabaIcon,
          "screen": const QiblahScreen(),
          "light_color": AppConsts.blueLightColor,
          "dark_color": AppConsts.blueDarkColor,
          "align": 2
        },
        {
          "title": "التسبيح \nوالاستغفار",
          "image": AppAssets.sabaIcon,
          "screen": const TasbeehScreen(),
          "light_color": AppConsts.skyBlueLightColor,
          "dark_color": AppConsts.skyBlueDarkColor,
          "align": 1
        }
      ];
}
